README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A Datomic Tutorial</a>
<ul>
<li><a href="#sec-1-1">1.1. Data Conceptual Shape</a></li>
<li><a href="#sec-1-2">1.2. Map Fields</a></li>
<li><a href="#sec-1-3">1.3. Basic Schema</a></li>
<li><a href="#sec-1-4">1.4. Testdata</a></li>
<li><a href="#sec-1-5">1.5. Blow away and recreate DB</a></li>
<li><a href="#sec-1-6">1.6. Better Testdata</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Query the database</a>
<ul>
<li><a href="#sec-2-1">2.1. Concept</a></li>
<li><a href="#sec-2-2">2.2. Breaking down the datomic query</a></li>
<li><a href="#sec-2-3">2.3. Where</a></li>
<li><a href="#sec-2-4">2.4. Find</a></li>
<li><a href="#sec-2-5">2.5. Pull Syntax</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Parent Child Data</a>
<ul>
<li><a href="#sec-3-1">3.1. Many Refs Schema</a></li>
<li><a href="#sec-3-2">3.2. Testdata</a></li>
<li><a href="#sec-3-3">3.3. Querying Parent Child Data</a></li>
<li><a href="#sec-3-4">3.4. Parent Child Pull Syntax</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Deeper Understanding</a>
<ul>
<li><a href="#sec-4-1">4.1. Fields cross SQL Table boundaries</a></li>
</ul>
</li>
</ul>
</div>
</div>

# A Datomic Tutorial<a id="sec-1" name="sec-1"></a>

## Data Conceptual Shape<a id="sec-1-1" name="sec-1-1"></a>

The data in datomic is conceptually one big vector of maps.  Re-read
that sentence and cement it inside your head.  Conceiving of datomic
like this is fundamental to understanding how to operate with it.

Each map in this vector is one *entity*, in the datomic vocabulary.
This corresponds to a row in a Relational Database Management System
(RDBMS).  Below is a sample database of data:

    [{:db/id 1
      :car/make "toyota"
      :car/model "tacoma"
      :year 2014}
    
     {:db/id 2
      :car/make "BMW"
      :car/model "325xi"
      :year 2001}
    
     {:db/id 3
      :user/name "ftravers"
      :user/age 54
      :cars [{:db/id 1}
             {:db/id 2}]}]

So this datomic database has 3 entries (entities/maps/rows).  A user,
`ftravers`, who owns 2 cars.  Every map (entity) must have a `:db/id`.
This is what uniquely identifies that entity to datomic.  Datomic
`:db/id`'s are actually very large integers, so the data above is
actually a bit fake, but I keep it simple to communicate the concept.

As we can see in the above example, the `:cars` field of the user
`ftravers` points (refers/links) to the cars he owns using the
`:db/id` field.  The `:db/id` field allows one entity to refer to
another entity (or many other entities).

## Map Fields<a id="sec-1-2" name="sec-1-2"></a>

So datomic is a vector of maps.  A map has fields, or keys, and in
clojure keywords are used.  The three maps, in our example we had the
fields/keys:

    :db/id
    :car/make
    :car/model
    :year
    :user/name
    :user/age
    :cars

Datomic doesn't allow you to just go ahead and pick any old keyword as
a field (or key) to entity maps.  Rather we have to specify ahead of
time which keywords entities in datomic can use.  This is called
creating a schema.

In the SQL world, creating a schema means defining table names, column
names and its data type.

In datomic, we do away with the concept of a table.  You could say
datomic ONLY specifies 'columns'.  Here a column in SQL is equivalent
to a field in datomic.  When we specify a column in SQL we give it a
name, and we indicate what it will hold, a string, integer, etc&#x2026;  In
datomic we do a similar thing, we define fields stating what their
name is and what type of data they hold.  Datomic calls fields
**attributes**.

So this is a bit of a big deal.  In RDBMS our columns are stuck
together in a table.  In datomic we define a bunch of fields that don't
necessarily have anything to do with one another.  We can randomly use
any field we define for any record we want to store.  Remember datomic
is just a bunch of maps floating around.  We are only allowed to pick
fields that have been predefined, but other than that, we can create
maps with any combinations of those fields.

Okay enough concepts, lets see how to define a field.

## Basic Schema<a id="sec-1-3" name="sec-1-3"></a>

Here we create a field in datomic.  We'll start with creating just one
field.  This field will *hold* an email value.

    (def schema [{:db/doc "A users email."
                  :db/id #db/id[:db.part/db]
                  :db/ident :user/email
                  :db/valueType :db.type/string
                  :db/cardinality :db.cardinality/one
                  :db.install/_attribute :db.part/db}])

`:db/ident` is the name of the field.  So when we want to use this
field to store data, this is the keyword you use.

`:db/valueType` is the type of data that this field will hold.  Here
we use the `string` datatype to store an email string.

`:db/cardinality` can be either `one` or `many`.  Basically should
this field hold a single item or a list of items.

Those are the important fields to understand conceptually. `:db/doc`
is a documentation string, remember everything in datomic needs it's
own `:db/id`, and `:db.install/_attribute` instructs datomic to treat
this data as schema field creation data.

Before we can start adding schema to a database, we need to create the
database!

    (def db-url "datomic:free://127.0.0.1:4334/omn-dev")
    (d/create-database db-url)
    (def db-conn (atom (d/connect db-url)))

Now we can load this schema definition into the database by
transacting it like so:

    (d/transact @db-conn schema)

## Testdata<a id="sec-1-4" name="sec-1-4"></a>

Now that we've defined a field, lets make use of it by
creating/inserting an entity that makes use of the newly created
field.  Remember data inside datomic is just a map, so lets just
create that map:

    (def test-data
      [{:db/id #db/id[:db.part/user -1]
        :user/email "fenton.travers@gmail.com"}])

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

So the `:user/email` part is understandable, but whats that other
field `:db/id` all about?  Remember whenever we add data into datomic
we need to create and give the entity a `:db/id`.  The part that looks
like: 

    #db/id[:db.part/user -1]

is basically asking datomic to replace this with a valid `:db/id`.
The -1 could be any negative number, and is like our fake temporary
id.  Datomic will, upon inserting this record (entity/map), create the
real permanent datomic id, `:db/id`.

Lets transact this data into the DB:

    (d/transact @db-conn test-data)

## Blow away and recreate DB<a id="sec-1-5" name="sec-1-5"></a>

When experimenting with datomic, I like to blow the database away, so
I know I'm starting with a clean slate each time.

    (d/delete-database db-url)
    (d/create-database db-url)
    (reset! db-conn (d/connect db-url))
    (d/transact @db-conn schema)
    (d/transact @db-conn test-data)

Here I blow it away, recreate a blank DB, recreate the connection,
transact the schema and testdata.

Working code can be found under the 

GIT TAG: basic-schema-insert

## Better Testdata<a id="sec-1-6" name="sec-1-6"></a>

Okay a DB with only one record (row/entity/map) in it is pretty
boring.  Also a db with only one string column (field) is next to
useless!  Lets create a DB with two entities (records/maps) in it.
Also lets create a second field, age, so we can query the database for
people 21 and older!

The schema:

    (def schema [{:db/doc "A users email."
                  :db/id #db/id[:db.part/db]
                  :db/ident :user/email
                  :db/valueType :db.type/string
                  :db/cardinality :db.cardinality/one
                  :db.install/_attribute :db.part/db}
    
                 {:db/doc "A users age."
                  :db/id #db/id[:db.part/db]
                  :db/ident :user/age
                  :db/valueType :db.type/long
                  :db/cardinality :db.cardinality/one
                  :db.install/_attribute :db.part/db}])

So we've added another field, age, that is type: `:db.type/long`.  Now
lets add some actual data:

    (def test-data
      [{:db/id #db/id[:db.part/user -1]
        :user/email "sally.jones@gmail.com"
        :user/age 34}
    
       {:db/id #db/id[:db.part/user -2]
        :user/email "franklin.rosevelt@gmail.com"
        :user/age 14}])

GIT TAG: better-testdata

Notice we need to specify a unique number for each entity in our
batch, so franklin's temp `:db/id` is -2, while sally's is -1.

**REMEMBER** to transact this schema and testdata into your cleaned up
DB!  Otherwise you'll get an error for trying to add the `:user/email`
field twice.
