README.org
** Concept

Now we have seen how to add data to datomic, the interesting part is
the querying of the data.  A query might be: "Give me the users who
are over 21", if you are making an app to see who is legal to drink
in the United States, for example.

In regular RDBMS we compare rows of tables based on the values in a
given column.  A similar SQL query might look like:

#+BEGIN_SRC SQL
SELECT user-email FROM users WHERE user-age > 21
#+END_SRC

In datomic we don't have tables, just a bunch of maps.  So we don't have
a ~FROM~ clause.  In our case we are inspecting the ~:user/age~ field,
so ANY entity (map), which has that field will be included in our
query.  This is a very important idea which we will revisit later to
re-inforce.

This is a critical concept.  When two maps use the same field, that's
what sort of links them together.  We will write our queries based on
these fields, so when we query on a field that a map uses, it gets
swept up in that query.

** Breaking down the datomic query

A query takes /datalog/ for its first argument and a /database/ to
execute that datalog on as the second argument.  Lets just look at
the datalog first:

#+BEGIN_SRC clojure
  [:find ?e
   :where [?e :user/email]]
#+END_SRC

Datalog is the query language to extract entities from datomic.  We
have two parts to the datalog, the ~:find~ part and the ~:where~ part.

** Where

The query (~:where~) part selects (narrows down) the records
(entities).  This is truly the querying part.  So this corresponds to
the ~WHERE~ clause in SQL. 

The ~:find~ part, is basically what to show from the found records.
So this naturally corresponds to the ~SELECT~ part of SQL.  Lets focus
on the ~:where~ part first.

Where clauses take one or more vector clauses that are of the form:

#+BEGIN_SRC clojure
[entity field-name field-value]
#+END_SRC

Working backwards in our example ~[?e :user/email]~, doesn't specify a
field-value, so this means the field-value can be anything.

Next we say we want maps that use the field (attributed):
~:user/email~.

Finally, the ~?e~, means each entity (maps) we find, store it in the
variable ~?e~, because we are going to use it in another part of our
datalog.

In summary this query reads like: "Get us all the entities in the DB
that have the field: ~:user/email~.

** Find

Finally we have the ~:find~ part of the datalog.  The correlates
directly to the ~SELECT~ aspect of SQL, and it basically indicates
what parts of the found records to return.

We just say: ~:find ?e~, so we'll get the entity id (~:db/id~),
returned.  We can convert an entity id, which is just an integer, into
a clojure map. 

Here is the full query, 

#+BEGIN_SRC clojure
  (defn query1 []
    (d/q '[:find ?e
           :where
           [?e :user/email]]
         (d/db @db-conn)))
#+END_SRC

and the result of running it:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
#{[17592186045418] [17592186045419]}
#+END_SRC

GIT TAG: simple-first-query

Hmmm...  Okay this is kind of far from what we put in:

#+BEGIN_SRC clojure
  (def test-data
    [{:db/id #db/id[:db.part/user -1]
      :user/email "sally.jones@gmail.com"
      :user/age 34}

     {:db/id #db/id[:db.part/user -2]
      :user/email "franklin.rosevelt@gmail.com"
      :user/age 14}])
#+END_SRC

Those numbers are the entity id's (~:db/id~) of the two records (maps)
we transacted into the database.

We are going to convert these entity ids into familiar clojure maps
using two approaches.  The first approach is a bit more instinctive,
and the second approach is more enlightened.

Instinctively, I'd look for an API to convert a ~:db/id~ into the
actual entity that the id represents.  So datomic has a function:
~entity~, which is documented like so:

"Returns a dynamic map of the entity's attributes for the given id"

Okay that looks promising.  A bit more research on google reveals the
following works:

#+BEGIN_SRC clojure
datomic-tutorial.core> (map #(seq (d/entity (d/db @db-conn) (first %))) (query1))
(([:user/email "sally.jones@gmail.com"] [:user/age 34])
 ([:user/email "franklin.rosevelt@gmail.com"] [:user/age 14]))
#+END_SRC

Okay, that is the instinctual approach to extract the data we are
looking for, now let me introduce a more enlightened approach, *pull*! 

** Pull Syntax

Instead of the line:

#+BEGIN_SRC clojure
:find ?e
#+END_SRC

we can convert that into pull syntax like so:

#+BEGIN_SRC clojure
  :find (pull ?e [:user/email :user/age])
#+END_SRC

and our output will now look like:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
[[#:user{:email "sally.jones@gmail.com", :age 34}]
 [#:user{:email "franklin.rosevelt@gmail.com", :age 14}]]
#+END_SRC

Okay, that looks a lot nicer!

The way to understand pull syntax is that the first argument is the
entity that you want to apply the pull syntax to.  As a reminder lets
put that here again so its fresh in your mind:

#+BEGIN_SRC clojure
  (def test-data
    [{:db/id #db/id[:db.part/user -1]
      :user/email "sally.jones@gmail.com"
      :user/age 34}

     {:db/id #db/id[:db.part/user -2]
      :user/email "franklin.rosevelt@gmail.com"
      :user/age 14}])
#+END_SRC

Now the second argument to the pull function is the pull pattern,
again: ~[:user/email :user/age]~.  Here we declare the fields we want
returned to us.  Once again the result of the pull syntax:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
[[#:user{:email "sally.jones@gmail.com", :age 34}]
 [#:user{:email "franklin.rosevelt@gmail.com", :age 14}]]
#+END_SRC

Much more user friendly!  Okay, now lets make a query that is more
interesting that just "get all entities who have the ~:user/email~
field!

Lets modify this query to only return people who are 21 and over.
Franklin, you aren't allowed to drink!

To achieve this we use the following TWO where clauses:

#+BEGIN_SRC clojure
  :where
  [?e :user/age ?age]
  [(>= ?age 21)]
#+END_SRC

The first thing to note about this query is that it contains two
clauses.  Where clauses are implicitly AND-ed together.  So both
criteria need to be true.

Lets breakdown the first part of the query: 

#+BEGIN_SRC clojure
  [?e :user/age ?age]
#+END_SRC

Remember where clauses are in the format: [entity field-name
field-value].  As an aside, documentation about datomic refers to this
as: [entity attribute value].

So this where clause reads like: "Find all entities that have the
field (attribute) ~:user/age~, and stick the entity into the variable
~?e~ and stick the value of the attribute, the actual users age, into
the variable ~?age~.

So for each entity that meets this criteria will have the entity
stored in the ~?e~ variable, and the age in the ~?age~ variable.  Now
we can make use of the age value in the second where clause:

#+BEGIN_SRC clojure
  [(>= ?age 21)]
#+END_SRC

Okay this is a special, and super cool variant on normal where
clauses.  We can run *ANY* function here that returns a boolean
result.  Well we know the function ~>=~ is a boolean value returning
function, so it's legit.  Second, for each entity, the users age will
be stored in the variable ~?age~, so we can simply pass that into the
function to get our bool result!  This just says, we want entities who
have an age >= 21.  Simple!

So here is the full new query:

#+BEGIN_SRC clojure
(defn query1 []
  (d/q '[:find (pull ?e [:user/email :user/age])
         :where
         [?e :user/age ?age]
         [(>= ?age 21)]]
       (d/db @db-conn)))
#+END_SRC

And now we get the desired result:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
[[#:user{:email "sally.jones@gmail.com", :age 34}]]
#+END_SRC

GIT TAG: query-pull-filter

