README.md

# Query the database<a id="sec-2" name="sec-2"></a>

## Concept<a id="sec-2-1" name="sec-2-1"></a>

Now we have seen how to add data to datomic, the interesting part is
the querying of the data.  A query might be: "Give me the users who
are over 21", if you are making an app to see who is legal to drink
in the United States, for example.

In regular RDBMS we compare rows of tables based on the values in a
given column.  A similar SQL query might look like:

    SELECT user-email FROM users WHERE user-age > 21

In datomic we don't have tables, just a bunch of maps.  So we don't have
a `FROM` clause.  In our case we are inspecting the `:user/age` field,
so ANY entity (map), which has that field will be included in our
query.  This is a very important idea which we will revisit later to
re-inforce.

This is a critical concept.  When two maps use the same field, that's
what sort of links them together.  We will write our queries based on
these fields, so when we query on a field that a map uses, it gets
swept up in that query.

## Breaking down the datomic query<a id="sec-2-2" name="sec-2-2"></a>

A query takes *datalog* for its first argument and a *database* to
execute that datalog on as the second argument.  Lets just look at
the datalog first:

    [:find ?e
     :where [?e :user/email]]

Datalog is the query language to extract entities from datomic.  We
have two parts to the datalog, the `:find` part and the `:where` part.

## Where<a id="sec-2-3" name="sec-2-3"></a>

The query (`:where`) part selects (narrows down) the records
(entities).  This is truly the querying part.  So this corresponds to
the `WHERE` clause in SQL. 

The `:find` part, is basically what to show from the found records.
So this naturally corresponds to the `SELECT` part of SQL.  Lets focus
on the `:where` part first.

Where clauses take one or more vector clauses that are of the form:

    [entity field-name field-value]

Working backwards in our example `[?e :user/email]`, doesn't specify a
field-value, so this means the field-value can be anything.

Next we say we want maps that use the field (attributed):
`:user/email`.

Finally, the `?e`, means each entity (maps) we find, store it in the
variable `?e`, because we are going to use it in another part of our
datalog.

In summary this query reads like: "Get us all the entities in the DB
that have the field: `:user/email`.

## Find<a id="sec-2-4" name="sec-2-4"></a>

Finally we have the `:find` part of the datalog.  The correlates
directly to the `SELECT` aspect of SQL, and it basically indicates
what parts of the found records to return.

We just say: `:find ?e`, so we'll get the entity id (`:db/id`),
returned.  We can convert an entity id, which is just an integer, into
a clojure map. 

Here is the full query, 

    (defn query1 []
      (d/q '[:find ?e
             :where
             [?e :user/email]]
           (d/db @db-conn)))

and the result of running it:

    datomic-tutorial.core> (query1)
    #{[17592186045418] [17592186045419]}

GIT TAG: simple-first-query

Hmmm&#x2026;  Okay this is kind of far from what we put in:

    (def test-data
      [{:db/id #db/id[:db.part/user -1]
        :user/email "sally.jones@gmail.com"
        :user/age 34}
    
       {:db/id #db/id[:db.part/user -2]
        :user/email "franklin.rosevelt@gmail.com"
        :user/age 14}])

Those numbers are the entity id's (`:db/id`) of the two records (maps)
we transacted into the database.

We are going to convert these entity ids into familiar clojure maps
using two approaches.  The first approach is a bit more instinctive,
and the second approach is more enlightened.

Instinctively, I'd look for an API to convert a `:db/id` into the
actual entity that the id represents.  So datomic has a function:
`entity`, which is documented like so:

"Returns a dynamic map of the entity's attributes for the given id"

Okay that looks promising.  A bit more research on google reveals the
following works:

    datomic-tutorial.core> (map #(seq (d/entity (d/db @db-conn) (first %))) (query1))
    (([:user/email "sally.jones@gmail.com"] [:user/age 34])
     ([:user/email "franklin.rosevelt@gmail.com"] [:user/age 14]))

Okay, that is the instinctual approach to extract the data we are
looking for, now let me introduce a more enlightened approach, **pull**! 

## Pull Syntax<a id="sec-2-5" name="sec-2-5"></a>

Instead of the line:

    :find ?e

we can convert that into pull syntax like so:

    :find (pull ?e [:user/email :user/age])

and our output will now look like:

    datomic-tutorial.core> (query1)
    [[#:user{:email "sally.jones@gmail.com", :age 34}]
     [#:user{:email "franklin.rosevelt@gmail.com", :age 14}]]

Okay, that looks a lot nicer!

The way to understand pull syntax is that the first argument is the
entity that you want to apply the pull syntax to.  As a reminder lets
put that here again so its fresh in your mind:

    (def test-data
      [{:db/id #db/id[:db.part/user -1]
        :user/email "sally.jones@gmail.com"
        :user/age 34}
    
       {:db/id #db/id[:db.part/user -2]
        :user/email "franklin.rosevelt@gmail.com"
        :user/age 14}])

Now the second argument to the pull function is the pull pattern,
again: `[:user/email :user/age]`.  Here we declare the fields we want
returned to us.  Once again the result of the pull syntax:

    datomic-tutorial.core> (query1)
    [[#:user{:email "sally.jones@gmail.com", :age 34}]
     [#:user{:email "franklin.rosevelt@gmail.com", :age 14}]]

Much more user friendly!  Okay, now lets make a query that is more
interesting that just "get all entities who have the `:user/email`
field!

Lets modify this query to only return people who are 21 and over.
Franklin, you aren't allowed to drink!

To achieve this we use the following TWO where clauses:

    :where
    [?e :user/age ?age]
    [(>= ?age 21)]

The first thing to note about this query is that it contains two
clauses.  Where clauses are implicitly AND-ed together.  So both
criteria need to be true.

Lets breakdown the first part of the query: 

    [?e :user/age ?age]

Remember where clauses are in the format: [entity field-name
field-value].  As an aside, documentation about datomic refers to this
as: [entity attribute value].

So this where clause reads like: "Find all entities that have the
field (attribute) `:user/age`, and stick the entity into the variable
`?e` and stick the value of the attribute, the actual users age, into
the variable `?age`.

So for each entity that meets this criteria will have the entity
stored in the `?e` variable, and the age in the `?age` variable.  Now
we can make use of the age value in the second where clause:

    [(>= ?age 21)]

Okay this is a special, and super cool variant on normal where
clauses.  We can run **ANY** function here that returns a boolean
result.  Well we know the function `>=` is a boolean value returning
function, so it's legit.  Second, for each entity, the users age will
be stored in the variable `?age`, so we can simply pass that into the
function to get our bool result!  This just says, we want entities who
have an age >= 21.  Simple!

So here is the full new query:

    (defn query1 []
      (d/q '[:find (pull ?e [:user/email :user/age])
             :where
             [?e :user/age ?age]
             [(>= ?age 21)]]
           (d/db @db-conn)))

And now we get the desired result:

    datomic-tutorial.core> (query1)
    [[#:user{:email "sally.jones@gmail.com", :age 34}]]

GIT TAG: query-pull-filter
