README.org
* Parent Child Data

Often we have data that owns other data.  For example our first
example looked like this:

#+BEGIN_SRC clojure
  [{:db/id 1
    :car/make "toyota"
    :car/model "tacoma"
    :year 2014}

   {:db/id 2
    :car/make "BMW"
    :car/model "325xi"
    :year 2001}

   {:db/id 3
    :user/name "ftravers"
    :user/age 54
    :cars [{:db/id 1}
           {:db/id 2}]}]
#+END_SRC

So how do we model this?  First we start with the schema.  We'll need
the fields: ~:car/make~, ~:car/model~, ~:year~, ~:user/name~, ~:user/age~,
and ~:cars~. 

~:car/make~, ~:car/model~, and ~:user/name~ are all of type ~string~
and cardinality one.  For ~:year~ and ~:user/age~ we can use integers.
~:cars~ is the new one.  

The field ~:cars~ has a cardinality of ~many~ also the type that it
will hold is of type reference, since we only want to refer to the
cars already defined in the DB.

Lets look only at the schema for ~:cars~, the others you should be
able to piece together from previous schema examples, or just look at
the:

GIT TAG: parent-child-modeling

** Many Refs Schema

For ~:cars~, the schema will look like:

#+BEGIN_SRC clojure
{:db/doc "List of cars a user owns"
    :db/id #db/id[:db.part/db]
    :db/ident :cars
    :db/valueType :db.type/ref
    :db/cardinality :db.cardinality/many
    :db.install/_attribute :db.part/db}
#+END_SRC 

Take special not of the values for ~cardinality~ and ~valueType~ that
we've used.  

A ~valueType~ of ~ref~ means we want this field to hold references to
other entities in the DB.  This is the critical difference between a
database and regular old clojure data structures that don't really
support references.

The second thing to note is the ~cardinality~ is ~many~.  That means
this field will hold a list of values, not just a single value.

** Testdata

Now lets make some testdata we can transaction into the DB:

#+BEGIN_SRC clojure
(def test-data
  [{:db/id #db/id[:db.part/user -1]
    :car/make "toyota"
    :car/model "tacoma"
    :year 2014}

   {:db/id #db/id[:db.part/user -2]
    :car/make "BMW"
    :car/model "325xi"
    :year 2001}

   {:db/id #db/id[:db.part/user -3]
    :user/name "ftravers"
    :user/age 54
    :cars [{:db/id #db/id[:db.part/user -1]}
           {:db/id #db/id[:db.part/user -2]}]}])
#+END_SRC

GIT TAG: parent-child-modeling

So now we've stuffed some parent/child data into the DB, lets see how
to get it out in a nice way.

** Querying Parent Child Data

First we'll find the record we care about with a where clause that
looks like:

#+BEGIN_SRC clojure
[?e :user/name "ftravers"]
#+END_SRC

This reads: "find all the entities that have the ~:user/name~
attribute (field) who's value is: ~"ftravers"~.  Now lets do some magic
with the pull syntax to get the data out how we want it.

** Parent Child Pull Syntax

We have already learned how to extract entity fields with a basic pull
pattern:

#+BEGIN_SRC clojure
(pull ?e [:user/name :user/age])
#+END_SRC

retrieves the ~:user/name~ and ~:user/age~ fields from the found
entity/entities.  Again the result looks like this:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
[[#:user{:name "ftravers", :age 54}]]
#+END_SRC

but what we really want is something that looks like:

#+BEGIN_SRC clojure
datomic-tutorial.core> (query1)
[[{:user/name "ftravers",
   :user/age 54,
   :cars
   [#:car{:make "toyota", :model "tacoma"}
    #:car{:make "BMW", :model "325xi"}]}]]
#+END_SRC

So we want more than just the simple fields that an entity has, but we
want to follow any references it has to other entities and get values
from those entities.

To get the above we change the query to look like:

#+BEGIN_SRC clojure
  (pull ?e
        [:user/name
         :user/age
         {:cars [:car/make :car/model]}])
#+END_SRC

So to get the children, and print out their fields, you start a new
map, whose key is the parent field that points to the child.  In our
case ~:cars~.  Then you start a vector and list the properties of the
child you wish to grab.

This is an extremely elegant way to extract arbitrary levels of data
from datomic.  Just imagine the mess this would look like with SQL.
Maybe here is a stab just for comparison.

#+BEGIN_SRC sql
SELECT users.id users.name, users.age, cars.make, cars.model, cars.year
FROM users cars
WHERE users.id == cars.userid AND users.name == "ftravers"
#+END_SRC

And this would produce a result like:

#+BEGIN_SRC clojure
  [[1 ftravers 54 "toyota" "tacoma" 2013]
   [1 ftravers 54 "BMW" "325xi" 2001]]
#+END_SRC

for comparison equivalent datalog:

#+BEGIN_SRC clojure
  '[:find
    (pull ?e
          [:user/name
           :user/age
           {:cars [:car/make :car/model]}])
    :where
    [?e :user/name "ftravers"]]
#+END_SRC

and its result:

#+BEGIN_SRC clojure
[[{:user/name "ftravers",
   :user/age 54,
   :cars
   [#:car{:make "toyota", :model "tacoma"}
    #:car{:make "BMW", :model "325xi"}]}]]
#+END_SRC

* Deeper Understanding

** Fields cross SQL Table boundaries

So pretend we have two entities like:

#+BEGIN_SRC clojure
{:user/name "ftravers"
:year 1945}

{:car/make "BMW 325xi"
:year 2001}
#+END_SRC

In datomic we can compare these two seemingly quite different objects
with each other because they share a field: ~:year~.  So I could write
a query that returns *ALL THINGS* that are older than 35 years old.
As I write this, it is 2017, so a 35 year old thing would be born
(made) in approximately the year: 1982.  So the where clause would
look like:

#+BEGIN_SRC clojure
  [?e :year ?year]
  [(<= ?year 1982)]
#+END_SRC

In RDBMS you normally are only ever comparing things that exist in the
same table.  So it'd be awkward to try a similar thing in an RDBMS.
Primarily because they wouldn't have a combined index for fields in
two separate tables.  So your performance would die.  In datomic each
field has it's own index, so a query like the above, would still be
performant. 
